diplom-result/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-result/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-result/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВКМ. Добавление группы ПериодДействия
		ГруппаПериодДействия = Элементы.Вставить("ВКМ_ГруппаПериодДействия", Тип("ГруппаФормы"), ЭтотОбъект, );
		ГруппаПериодДействия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ГруппаПериодДействия.Видимость = Истина;
		Иначе
			ГруппаПериодДействия.Видимость = Ложь;
		КонецЕсли;
	
	//ВКМ. Добавление поля ДатаНачалаДействияДоговора
		ПолеВводаДатаНачалаДействияДоговора = Элементы.Вставить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Элементы.ВКМ_ГруппаПериодДействия, );
		ПолеВводаДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		ПолеВводаДатаНачалаДействияДоговора.Заголовок = "Дата начала действия договора";
				
	//ВКМ. Добавление поля ДатаОкончанияДействияДоговора
		ПолеВводаДатаОкончанияДействияДоговора = Элементы.Вставить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Элементы.ВКМ_ГруппаПериодДействия, );
		ПолеВводаДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		ПолеВводаДатаОкончанияДействияДоговора.Заголовок = "Дата окончания действия договора";
			
	//ВКМ. Добавление поля СуммаАбонентскойПлаты	
		ПолеВводаСуммаАбонентскойПлаты = Элементы.Вставить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ,);
		ПолеВводаСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		ПолеВводаСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
				
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ПолеВводаСуммаАбонентскойПлаты.Видимость = Истина;
		Иначе
			ПолеВводаСуммаАбонентскойПлаты.Видимость = Ложь;
		КонецЕсли;
			
	//ВКМ. Добавление поля СтоимостьЧасаРаботыСпециалиста
		ПолеВводаСтоимостьЧасаРаботыСпециалиста = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"), ,);
		ПолеВводаСтоимостьЧасаРаботыСпециалиста.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСтоимостьЧасаРаботыСпециалиста.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
		ПолеВводаСтоимостьЧасаРаботыСпециалиста.Заголовок = "Стоимость часа работы специалиста";
				
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ПолеВводаСтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
		Иначе
			ПолеВводаСтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	//ВКМ. Видимость полей при изменении вида договора
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			Элементы.ВКМ_ГруппаПериодДействия.Видимость = Истина;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
		Иначе
			Элементы.ВКМ_ГруппаПериодДействия.Видимость = Ложь;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
			Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
